; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-7 - location
	p0-9 - location
	p1-5 - location
	p2-6 - location
	p2-7 - location
	p2-10 - location
	p2-13 - location
	p3-1 - location
	p3-11 - location
	p4-0 - location
	p4-10 - location
	p5-0 - location
	p5-8 - location
	p5-10 - location
	p6-9 - location
	p9-4 - location
	p9-11 - location
	p10-9 - location
	p11-1 - location
	p11-2 - location
	p11-12 - location
	p12-3 - location
	p12-4 - location
	)
	(:init
	(at driver1 s9)
	(at driver2 s12)
	(at driver3 s12)
	(at driver4 s12)
	(at driver5 s1)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s9)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s10)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s7)
	(at package2 s9)
	(at package3 s7)
	(at package4 s9)
	(at package5 s2)
	(at package6 s6)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(path s2 p2-13)
	(path p2-13 s2)
	(path s13 p2-13)
	(path p2-13 s13)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-11)
	(path p3-11 s3)
	(path s11 p3-11)
	(path p3-11 s11)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-11)
	(path p9-11 s9)
	(path s11 p9-11)
	(path p9-11 s11)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-2)
	(path p11-2 s11)
	(path s2 p11-2)
	(path p11-2 s2)
	(path s11 p11-12)
	(path p11-12 s11)
	(path s12 p11-12)
	(path p11-12 s12)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(path s12 p12-4)
	(path p12-4 s12)
	(path s4 p12-4)
	(path p12-4 s4)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 88)
	(= (time-to-drive s2 s0) 88)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 75)
	(= (time-to-drive s0 s1) 75)
	(link s1 s11)
	(link s11 s1)
	(= (time-to-drive s1 s11) 14)
	(= (time-to-drive s11 s1) 14)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 21)
	(= (time-to-drive s1 s2) 21)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 69)
	(= (time-to-drive s2 s3) 69)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 57)
	(= (time-to-drive s5 s3) 57)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 7)
	(= (time-to-drive s8 s3) 7)
	(link s3 s12)
	(link s12 s3)
	(= (time-to-drive s3 s12) 28)
	(= (time-to-drive s12 s3) 28)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 57)
	(= (time-to-drive s2 s4) 57)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 81)
	(= (time-to-drive s7 s4) 81)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 3)
	(= (time-to-drive s10 s4) 3)
	(link s4 s13)
	(link s13 s4)
	(= (time-to-drive s4 s13) 7)
	(= (time-to-drive s13 s4) 7)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 9)
	(= (time-to-drive s4 s5) 9)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 24)
	(= (time-to-drive s1 s6) 24)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 96)
	(= (time-to-drive s3 s6) 96)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 11)
	(= (time-to-drive s2 s7) 11)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 51)
	(= (time-to-drive s9 s7) 51)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 38)
	(= (time-to-drive s11 s7) 38)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 68)
	(= (time-to-drive s1 s8) 68)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 56)
	(= (time-to-drive s6 s8) 56)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 49)
	(= (time-to-drive s0 s9) 49)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 48)
	(= (time-to-drive s1 s9) 48)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 32)
	(= (time-to-drive s2 s9) 32)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 100)
	(= (time-to-drive s4 s9) 100)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 28)
	(= (time-to-drive s1 s10) 28)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 57)
	(= (time-to-drive s6 s10) 57)
	(link s11 s0)
	(link s0 s11)
	(= (time-to-drive s11 s0) 64)
	(= (time-to-drive s0 s11) 64)
	(link s11 s2)
	(link s2 s11)
	(= (time-to-drive s11 s2) 87)
	(= (time-to-drive s2 s11) 87)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 19)
	(= (time-to-drive s3 s11) 19)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 99)
	(= (time-to-drive s8 s11) 99)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 23)
	(= (time-to-drive s9 s11) 23)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 6)
	(= (time-to-drive s4 s12) 6)
	(link s12 s13)
	(link s13 s12)
	(= (time-to-drive s12 s13) 74)
	(= (time-to-drive s13 s12) 74)
	(link s13 s7)
	(link s7 s13)
	(= (time-to-drive s13 s7) 36)
	(= (time-to-drive s7 s13) 36)
	(link s13 s11)
	(link s11 s13)
	(= (time-to-drive s13 s11) 27)
	(= (time-to-drive s11 s13) 27)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver4 s2)
	(at driver5 s11)
	(at truck1 s9)
	(at truck2 s10)
	(at truck3 s11)
	(at package1 s13)
	(at package2 s13)
	(at package3 s9)
	(at package4 s7)
	(at package5 s6)
	(at package6 s5)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (load-truck package2 truck2 s9)
   deleted: (at package2 s9)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 0 of 12
2. (walk driver4 s12 p11-12)
   deleted: (at driver4 s12)
   added: (at driver4 p11-12)
   goals met: 0 of 12
3. (load-truck package4 truck2 s9)
   deleted: (at package4 s9)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 0 of 12
4. (walk driver4 p11-12 s11)
   deleted: (at driver4 p11-12)
   added: (at driver4 s11)
   goals met: 0 of 12
5. (walk driver2 s12 p12-4)
   deleted: (at driver2 s12)
   added: (at driver2 p12-4)
   goals met: 0 of 12
6. (walk driver5 s1 p11-1)
   deleted: (at driver5 s1)
   added: (at driver5 p11-1)
   goals met: 0 of 12
7. (walk driver5 p11-1 s11)
   deleted: (at driver5 p11-1)
   added: (at driver5 s11)
   goals met: 1 of 12
8. (walk driver2 p12-4 s4)
   deleted: (at driver2 p12-4)
   added: (at driver2 s4)
   goals met: 2 of 12
9. (walk driver4 s11 p11-2)
   deleted: (at driver4 s11)
   added: (at driver4 p11-2)
   goals met: 2 of 12
10. (board-truck driver1 truck2 s9)
   deleted: (at driver1 s9) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 12
11. (walk driver4 p11-2 s2)
   deleted: (at driver4 p11-2)
   added: (at driver4 s2)
   goals met: 3 of 12
12. (walk driver2 s4 p4-10)
   deleted: (at driver2 s4)
   added: (at driver2 p4-10)
   goals met: 2 of 12
13. (board-truck driver4 truck1 s2)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 12
14. (drive-truck truck2 s9 s7 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s7)
   changed: (fuel-used) from 0 to 663
   goals met: 1 of 12
15. (unload-truck package4 truck2 s7)
   deleted: (in package4 truck2)
   added: (at package4 s7)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 2 of 12
16. (load-truck package1 truck2 s7)
   deleted: (at package1 s7)
   added: (in package1 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 12
17. (load-truck package3 truck2 s7)
   deleted: (at package3 s7)
   added: (in package3 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 12
18. (drive-truck truck2 s7 s13 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s13)
   changed: (fuel-used) from 663 to 1239
   goals met: 2 of 12
19. (unload-truck package1 truck2 s13)
   deleted: (in package1 truck2)
   added: (at package1 s13)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 3 of 12
20. (unload-truck package2 truck2 s13)
   deleted: (in package2 truck2)
   added: (at package2 s13)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 4 of 12
21. (load-truck package5 truck1 s2)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 12
22. (walk driver2 p4-10 s10)
   deleted: (at driver2 p4-10)
   added: (at driver2 s10)
   goals met: 4 of 12
23. (board-truck driver2 truck3 s10)
   deleted: (at driver2 s10) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 4 of 12
24. (drive-truck truck2 s13 s4 driver1)
   deleted: (at truck2 s13)
   added: (at truck2 s4)
   changed: (fuel-used) from 1239 to 1316
   goals met: 4 of 12
25. (drive-truck truck1 s2 s9 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   changed: (fuel-used) from 1316 to 1668
   goals met: 5 of 12
26. (drive-truck truck2 s4 s9 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s9)
   changed: (fuel-used) from 1668 to 2768
   goals met: 5 of 12
27. (unload-truck package3 truck2 s9)
   deleted: (in package3 truck2)
   added: (at package3 s9)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 12
28. (drive-truck truck2 s9 s4 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s4)
   changed: (fuel-used) from 2768 to 3768
   goals met: 6 of 12
29. (drive-truck truck3 s10 s4 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s4)
   changed: (fuel-used) from 3768 to 3798
   goals met: 6 of 12
30. (drive-truck truck2 s4 s10 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (fuel-used) from 3798 to 3828
   goals met: 7 of 12
31. (drive-truck truck2 s10 s6 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s6)
   changed: (fuel-used) from 3828 to 4398
   goals met: 6 of 12
32. (load-truck package6 truck2 s6)
   deleted: (at package6 s6)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 12
33. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 7 of 12
34. (drive-truck truck2 s6 s10 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s10)
   changed: (fuel-used) from 4398 to 5025
   goals met: 8 of 12
35. (drive-truck truck1 s9 s1 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (fuel-used) from 5025 to 5553
   goals met: 7 of 12
36. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 12
37. (drive-truck truck2 s10 s4 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s4)
   changed: (fuel-used) from 5553 to 5586
   goals met: 5 of 12
38. (drive-truck truck2 s4 s5 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 5586 to 5685
   goals met: 5 of 12
39. (unload-truck package6 truck2 s5)
   deleted: (in package6 truck2)
   added: (at package6 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 12
40. (drive-truck truck2 s5 s4 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 5685 to 5775
   goals met: 6 of 12
41. (drive-truck truck2 s4 s10 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (fuel-used) from 5775 to 5805
   goals met: 7 of 12
42. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 5805 to 6375
   goals met: 7 of 12
43. (drive-truck truck1 s1 s2 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 6375 to 6606
   goals met: 7 of 12
44. (unload-truck package5 truck1 s2)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 12
45. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 12
46. (drive-truck truck1 s2 s9 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   changed: (fuel-used) from 6606 to 6926
   goals met: 8 of 12
47. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 6926 to 7685
   goals met: 8 of 12
48. (drive-truck truck3 s3 s6 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 7685 to 8741
   goals met: 8 of 12
49. (unload-truck package5 truck3 s6)
   deleted: (in package5 truck3)
   added: (at package5 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 12
50. (drive-truck truck3 s6 s10 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s10)
   changed: (fuel-used) from 8741 to 9311
   goals met: 9 of 12
51. (drive-truck truck1 s9 s2 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s2)
   changed: (fuel-used) from 9311 to 9631
   goals met: 8 of 12
52. (drive-truck truck3 s10 s1 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s1)
   changed: (fuel-used) from 9631 to 9911
   goals met: 8 of 12
53. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 8 of 12
54. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 9 of 12
55. (disembark-truck driver1 truck2 s10)
   deleted: (driving driver1 truck2)
   added: (at driver1 s10) (empty truck2)
   goals met: 9 of 12
56. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 12
57. (drive-truck truck3 s1 s11 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s11)
   changed: (fuel-used) from 9911 to 10051
   goals met: 10 of 12
58. (board-truck driver4 truck1 s2)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 9 of 12
59. (drive-truck truck1 s2 s9 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   changed: (fuel-used) from 10051 to 10371
   goals met: 10 of 12
60. (disembark-truck driver2 truck3 s11)
   deleted: (driving driver2 truck3)
   added: (at driver2 s11) (empty truck3)
   goals met: 10 of 12
61. (disembark-truck driver4 truck1 s9)
   deleted: (driving driver4 truck1)
   added: (at driver4 s9) (empty truck1)
   goals met: 10 of 12
62. (walk driver2 s11 p9-11)
   deleted: (at driver2 s11)
   added: (at driver2 p9-11)
   goals met: 10 of 12
63. (walk driver2 p9-11 s9)
   deleted: (at driver2 p9-11)
   added: (at driver2 s9)
   goals met: 10 of 12
64. (board-truck driver2 truck1 s9)
   deleted: (at driver2 s9) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 12
65. (drive-truck truck1 s9 s4 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (fuel-used) from 10371 to 11371
   goals met: 9 of 12
66. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 10 of 12
67. (walk driver4 s9 p10-9)
   deleted: (at driver4 s9)
   added: (at driver4 p10-9)
   goals met: 10 of 12
68. (board-truck driver2 truck1 s4)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 9 of 12
69. (drive-truck truck1 s4 s9 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   changed: (fuel-used) from 11371 to 12371
   goals met: 10 of 12
70. (disembark-truck driver2 truck1 s9)
   deleted: (driving driver2 truck1)
   added: (at driver2 s9) (empty truck1)
   goals met: 10 of 12
71. (walk driver2 s9 p9-4)
   deleted: (at driver2 s9)
   added: (at driver2 p9-4)
   goals met: 10 of 12
72. (walk driver2 p9-4 s4)
   deleted: (at driver2 p9-4)
   added: (at driver2 s4)
   goals met: 11 of 12
73. (walk driver4 p10-9 s10)
   deleted: (at driver4 p10-9)
   added: (at driver4 s10)
   goals met: 11 of 12
74. (walk driver4 s10 p2-10)
   deleted: (at driver4 s10)
   added: (at driver4 p2-10)
   goals met: 11 of 12
75. (walk driver4 p2-10 s2)
   deleted: (at driver4 p2-10)
   added: (at driver4 s2)
   goals met: 12 of 12
